dltech/headphones/lib/cc2640_reg/prcm_reg.h
#ifndef H_PRCM_REGS
#define H_PRCM_REGS
/*
 * Simple CC2640 headphones
 * Power, Reset, and Clock Management registers
 *
 * Copyright 2022 Mikhail Belkin <dltech174@gmail.com>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
#include "memorymap.h"

/* Controls clock source selects */
#define CTL0                    MMIO32(AUX_DDI0_OSC + 0x00)
// Set based on the accurate high frequency XTAL.
#define XTAL_IS_24M                 0x80000000
//...
#define BYPASS_XOSC_LF_CLK_QUAL     0x20000000
//...
#define BYPASS_RCOSC_LF_CLK_QUAL    0x10000000
//...
#define DOUBLER_START_DURATION_SFT  26
#define DOUBLER_START_DURATION_MSK  0x3
//...
#define DOUBLER_RESET_DURATION      0x02000000
//...
#define FORCE_KICKSTART_EN          0x00400000
// 1: Allows switching of sclk_hf source.
#define ALLOW_SCLK_HF_SWITCHING     0x00010000
//...
#define HPOSC_MODE_EN               0x00004000
//...
#define RCOSC_LF_TRIMMED            0x00001000
//...
#define XOSC_HF_POWER_MODE          0x00000800
//Bypass XOSC_LF and use the digital input clock from AON for the xosc_lf clock.
#define XOSC_LF_DIG_BYPASS          0x00000400
// Enable clock loss detection and hence the indicators to system controller.
#define CLK_LOSS_EN                 0x00000200
// Source select for aclk_tdc.
#define ACLK_TDC_SRC_SEL            0x00000100
// Source select for aclk_ref
#define ACLK_REF_SRC_SEL_RCOSC_HF   0x00000000
#define ACLK_REF_SRC_SEL_XOSC_HF    0x00000020
#define ACLK_REF_SRC_SEL_RCOSC_LF   0x00000040
#define ACLK_REF_SRC_SEL_XOSC_LF    0x00000060
//...
#define SPARE4                      0x00000010
// Source select for sclk_lf.
#define SCLK_LF_SRC_SEL_RCOSC_HF    0x00000000
#define SCLK_LF_SRC_SEL_XOSC_HF     0x00000004
#define SCLK_LF_SRC_SEL_RCOSC       0x00000008
#define SCLK_LF_SRC_SEL_XOSC        0x0000000c
//...
#define SCLK_MF_SRC_SEL             0x00000002
// Source select for sclk_hf.
#define SCLK_HF_SRC_SEL             0x00000001

/* This register contains OSC_DIG configuration */
#define CTL1                    MMIO32(AUX_DDI0_OSC + 0x04)
//...
#define RCOSCHFCTRIMFRACT_SFT   12
#define RCOSCHFCTRIMFRACT_MSK   0x1f
//...
#define RCOSCHFCTRIMFRACT_EN    0x00020000
//...
#define SPARE2_SFT              2
#define SPARE2_MSK              0x7fff
//...
#define XOSC_HF_FAST_START_SFT  0
#define XOSC_HF_FAST_START_MSK  0x3

/* RADC External Configuration */
#define RADCEXTCFG              MMIO32(AUX_DDI0_OSC + 0x08)
//...
#define HPM_IBIAS_WAIT_CNT_SFT  22
#define HPM_IBIAS_WAIT_CNT_MSK  0x3ff
//...
#define LPM_IBIAS_WAIT_CNT_SFT  16
#define LPM_IBIAS_WAIT_CNT_MSK  0x3f
//...
#define IDAC_STEP_SFT           12
#define IDAC_STEP_MSK           0xf
//...
#define RADC_DAC_TH_SFT         6
#define RADC_DAC_TH_MSK         0x3f
//...
#define RADC_MODE_IS_SAR        0x00000020

/* Amplitude Compensation Control */
#define AMPCOMPCTL              MMIO32(AUX_DDI0_OSC + 0x0c)
//...
#define SPARE31                         0x80000000
//...
#define AMPCOMP_REQ_MODE                0x40000000
//...
#define AMPCOMP_FSM_UPDATE_RATE_SFT     28
#define AMPCOMP_FSM_UPDATE_RATE_MSK     0x3
//...
#define AMPCOMP_SW_CTRL                 0x08000000
//...
#define AMPCOMP_SW_EN                   0x04000000
//...
#define IBIAS_OFFSET_SFT                20
#define IBIAS_OFFSET_MSK                0xf
//...
#define IBIAS_INIT_SFT                  16
#define IBIAS_INIT_MSK                  0xf
//...
#define LPM_IBIAS_WAIT_CNT_FINAL_SFT    8
#define LPM_IBIAS_WAIT_CNT_FINAL_MSK    0xff
//...
#define CAP_STEP_SFT                    4
#define CAP_STEP_MSK                    0xf
//...
#define IBIASCAP_HPTOLP_OL_CNT_SFT      0
#define IBIASCAP_HPTOLP_OL_CNT_MSK      0xf

/* Amplitude Compensation Threshold 1 */
#define AMPCOMPTH1              MMIO32(AUX_DDI0_OSC + 0x10)
//...
#define SPARE24_SFT                 24
#define SPARE24_MSK                 0xff
//...
#define HPMRAMP3_LTH_SFT            18
#define HPMRAMP3_LTH_MSK            0x3f
//...
#define SPARE16_SFT                 16
#define SPARE16_MSK                 0x3
//...
#define HPMRAMP3_HTH_SFT            10
#define HPMRAMP3_HTH_MSK            0xf
//...
#define IBIASCAP_LPTOHP_OL_CNT_SFT  6
#define IBIASCAP_LPTOHP_OL_CNT_MSK  0xf
//...
#define HPMRAMP1_TH_SFT             0
#define HPMRAMP1_TH_MSK             0x3f

/* Amplitude Compensation Threshold 2 */
#define AMPCOMPTH2              MMIO32(AUX_DDI0_OSC + 0x14)
//...
#define LPMUPDATE_LTH_SFT       26
#define LPMUPDATE_LTH_MSK       0x3f
//...
#define SPARE24_SFT             24
#define SPARE24_MSK             0x3
//...
#define LPMUPDATE_HTH_SFT       18
#define LPMUPDATE_HTH_MSK       0x3f
//...
#define SPARE16_SFT             16
#define SPARE16_MSK             0x3
//...
#define ADC_COMP_AMPTH_LPM_SFT  10
#define ADC_COMP_AMPTH_LPM_MSK  0x3f
//...
#define SPARE8_SFT              8
#define SPARE8_MSK              0x3
//...
#define ADC_COMP_AMPTH_HPM_SFT  2
#define ADC_COMP_AMPTH_HPM_MSK  0x3f
//...
#define SPARE0_SFT              0
#define SPARE0_MSK              0x3

/* Analog Bypass Values 1 */
#define ANABYPASSVAL1           MMIO32(AUX_DDI0_OSC + 0x18)
//...
#define XOSC_HF_ROW_Q12_SFT     16
#define XOSC_HF_ROW_Q12_MSK     0xf
//...
#define XOSC_HF_COLUMN_Q12_SFT  0
#define XOSC_HF_COLUMN_Q12_MSK  0xffff

/* ANABYPASSVAL2 Register */
#define ANABYPASSVAL2           MMIO32(AUX_DDI0_OSC + 0x1c)
//...
#define XOSC_HF_IBIASTHERM_SFT  0
#define XOSC_HF_IBIASTHERM_MSK  0x3fff

/* Analog Test Control */
#define ATESTCTL	            MMIO32(AUX_DDI0_OSC + 0x20)
//...
#define SPARE30_SFT     16
#define SPARE30_MSK     0xf
//...
#define SCLK_LF_AUX_EN  0x20000000

/* ADC Doubler Nanoamp Control */
#define ADCDOUBLERNANOAMPCTL    MMIO32(AUX_DDI0_OSC + 0x24)
//...
#define NANOAMP_BIAS_ENABLE 0x01000000
//...
#define SPARE23             0x00800000
//...
#define ADC_SH_MODE_EN      0x00000020
//...
#define ADC_SH_VBUF_EN      0x00000010
//...
#define ADC_IREF_CTRL_SFT   0
#define ADC_IREF_CTRL_MSK   0x2

/* XOSCHF Control */
#define XOSCHFCTL               MMIO32(AUX_DDI0_OSC + 0x28)

/* Low Frequency Oscillator Control */
#define LFOSCCTL                MMIO32(AUX_DDI0_OSC + 0x2c)

