dltech/headphones/lib/cc2640_reg/prcm_reg.h
/* RCOSCHF Control */
#define RCOSCHFCTL              MMIO32(AUX_DDI0_OSC + 0x30)

/* This register contains status signals from OSC_DIG */
#define STAT0                   MMIO32(AUX_DDI0_OSC + 0x34)

/* Status 1 */
#define STAT1                   MMIO32(AUX_DDI0_OSC + 0x38)

/* This register contains status signals from AMPCOMP FSM */
#define STAT2                   MMIO32(AUX_DDI0_OSC + 0x3c)
// DC Bias read by RADC during SAR mode
#define ADC_DCBIAS_SFT      26
#define ADC_DCBIAS_MSK      0x3f
// Indication of threshold is met for hpm_ramp1
#define HPM_RAMP1_THMET     0x02000000
// Indication of threshold is met for hpm_ramp2
#define HPM_RAMP2_THMET     0x01000000
// Indication of threshold is met for hpm_ramp3
#define HPM_RAMP3_THMET     0x00800000
// xosc_hf amplitude compensation FSM
#define RAMPSTATE_SFT       12
#define RAMPSTATE_MSK       0xf
// ampcomp_req
#define AMPCOMP_REQ         0x00000008
// amplitude of xosc_hf is within the required threshold (set by DDI).
#define XOSC_HF_AMPGOOD     0x00000004
// frequency of xosc_hf is good to use for the digital clocks
#define XOSC_HF_FREQGOOD    0x00000002
// frequency of xosc_hf is within +/- 20 ppm and xosc_hf is good for radio.
#define XOSC_HF_RF_FREQGOOD 0x00000001


/* Power Management */
#define PWRCTL                  MMIO32(AON_SYSCTL + 0x0)
// Select to use DCDC regulator for VDDR in active mode.
#define DCDC_ACTIVE     0x00000004
// Status of source for VDDRsupply.
#define EXT_REG_MODE    0x00000002
// Select to use DCDC regulator during recharge of VDDR.
#define DCDC_EN         0x00000001

/* Reset Management */
#define RESETCTL                MMIO32(AON_SYSCTL + 0x0)
// Cold reset register.
#define SYSRESET            0x80000000
//...
#define BOOT_DET_1_CLR      0x02000000
//...
#define BOOT_DET_0_CLR      0x01000000
//...
#define BOOT_DET_1_SET      0x00020000
//...
#define BOOT_DET_0_SET      0x00010000
// A Wakeup from SHUTDOWN on an IO event has occurred.
#define WU_FROM_SD          0x00008000
// A wakeup from SHUTDOWN on an IO event has occurred.
#define GPIO_WU_FROM_SD     0x00004000
//...
#define BOOT_DET_1          0x00002000
//...
#define BOOT_DET_0          0x00001000
// Override of VDDS_LOSS_EN.
#define VDDS_LOSS_EN_OVR    0x00000800
// Override of VDDR_LOSS_EN.
#define VDDR_LOSS_EN_OVR    0x00000400
// Override of VDD_LOSS_EN.
#define VDD_LOSS_EN_OVR     0x00000200
// Controls reset generation in case VDDS is lost.
#define VDDS_LOSS_EN        0x00000080
// Controls reset generation in case VDDR is lost.
#define VDDR_LOSS_EN        0x00000040
// Controls reset generation in case VDD is lost.
#define VDD_LOSS_EN         0x00000020
// Controls reset generation in case SCLK_LF is lost.
#define CLK_LOSS_EN         0x00000010
// Shows the source of the last system reset.
#define RESET_SRC_POR       0x00000000
#define RESET_SRC_PIN       0x00000002
#define RESET_SRC_BOD_VDDS  0x00000004
#define RESET_SRC_BOD_VDD   0x00000006
#define RESET_SRC_BOD_VDDR  0x00000008
#define RESET_SRC_CLK_LOSS  0x0000000a
#define RESET_SRC_SYSRESET  0x0000000c
#define RESET_SRC_PRCM      0x0000000e

/* Sleep Mode */
#define SLEEPCTL                MMIO32(AON_SYSCTL + 0x0)
// Controls the I/O pad sleep mode.
#define IO_PAD_SLEEP_DIS    0x00000001


/* MCU Clock Management */
#define MCUCLK                  MMIO32(AON_WUC + 0x00)
// MCU bootcode will set this bit when RCOSC_HF is calibrated.
#define RCOSC_HF_CAL_DONE   0x00000004
//Controls the clk src for the entire MCU domain while MCU is requesting pwdn.
#define PWR_DWN_SRC_SCLK_LF 0x00000001

/* AUX Clock Management */
#define AUXCLK                  MMIO32(AON_WUC + 0x04)
//
#define PWR_DWN_SRC_SCLK_LF 0x00000800
// Select the AUX clock divider for SCLK_HF.
#define SCLK_HF_DIV2        0x00000000
#define SCLK_HF_DIV4        0x00000100
#define SCLK_HF_DIV8        0x00000200
#define SCLK_HF_DIV16       0x00000300
#define SCLK_HF_DIV32       0x00000400
#define SCLK_HF_DIV64       0x00000500
#define SCLK_HF_DIV128      0x00000600
#define SCLK_HF_DIV256      0x00000700
// Selects the clock source for AUX.
#define SRC_SCLK_HF         0x00000001
#define SRC_SCLK_HF         0x00000004

/* MCU Configuration */
#define MCUCFG                  MMIO32(AON_WUC + 0x08)
//...
#define VIRT_OFF            0x00020000
//...
#define FIXED_WU_EN         0x00010000
//This register controls which of the banks that has retention during MCU pwroff
#define SRAM_RET_EN_DIS     0x00000000
#define SRAM_RET_EN_BANK0   0x00000001
#define SRAM_RET_EN_BANK0_1 0x00000003
#define SRAM_RET_EN_BANK1_2 0x00000007
#define SRAM_RET_EN_BANK0_3 0x0000000f

/* This register contains power management related signals for the AUX domain.*/
#define AUXCFG                  MMIO32(AON_WUC + 0x0c)
// This bit controls retention mode for the AUX_RAM:BANK0.
#define RAM_RET_EN  0x00000001

/* This register contains events and control signals for the AUX domain. */
#define AUXCTL                  MMIO32(AON_WUC + 0x10)
// Reset request for AUX.
#define RESET_REQ       0x80000000
// Enables (1) or disables (0) AUX_SCE execution.
#define SCE_RUN_EN      0x00000004
// Writing 1 sets the software event to the AUX domain
#define SWEV            0x00000002
// Forces the AUX domain into active mode, overriding the requests.
#define AUX_FORCE_ON    0x00000001

/* Power Status */
#define PWRSTAT                 MMIO32(AON_WUC + 0x14)
// Indicates the AUX powerdown state when AUX domain is powered up.
#define AUX_PWR_DWN         0x00000200
// Indicates JTAG power state.
#define JTAG_PD_ON          0x00000040
// Indicates AUX power state.
#define AUX_PD_ON           0x00000020
// Indicates MCU power state.
#define MCU_PD_ON           0x00000010
// Indicates that AUX Bus is connected.
#define AUX_BUS_CONNECTED   0x00000004
// Indicates Reset Done from AUX.
#define AUX_RESET_DONE      0x00000002

/* Shutdown Control */
#define SHUTDOWN                MMIO32(AON_WUC + 0x18)
// Writing a 1 to this bit forces a shutdown request.
#define EN  0x00000001

/* This register contains various chip level control and debug bitfields. */
#define CTL0                    MMIO32(AON_WUC + 0x20)
// Controls whether MCU and AUX requesting to be powered off will enable a
// transition to powerdown:
#define PWR_DWN_DIS     0x00000100
//...
#define AUX_SRAM_ERASE  0x00000008
//...
#define MCU_SRAM_ERASE  0x00000004

/* Control 1 */
#define CTL1                    MMIO32(AON_WUC + 0x24)
// Indicates source of last MCU Voltage Domain warm reset request.
#define MCU_RESET_SRC   0x00000002
// Indicates type of last MCU Voltage Domain reset.
#define MCU_WARM_RESET  0x00000001

