dltech/headphones/lib/cc2640_reg/prcm_reg.h
/* Recharge Controller Configuration */
#define RECHARGECFG             MMIO32(AON_WUC + 0x30)
// Enable adaptive recharge
#define ADAPTIVE_EN     0x80000000
// Gain factor for adaptive recharge algorithm
#define C2_SFT              20
#define C2_MSK              0xf
#define C2_SFT              16
#define C2_MSK              0xf
//This register defines the maximum period that the recharge algorithm can take
#define MAX_PER_M_SFT       11
#define MAX_PER_M_MSK       0x1f
#define MAX_PER_E_SFT       8
#define MAX_PER_E_MSK       0x7
// Number of 32 KHz clocks between activation of recharge controller.
#define RECHARGE_PER_M_SFT  3
#define RECHARGE_PER_M_MSK  0x1f
#define RECHARGE_PER_E_SFT  0
#define RECHARGE_PER_E_MSK  0x7

/* Recharge Controller Status */
#define RECHARGESTAT            MMIO32(AON_WUC + 0x34)
// The last 4 VDDR samples, bit 0 being the newest.
#define VDDR_SMPLS_SFT      16
#define VDDR_SMPLS_MSK      0xf
// The maximum value of recharge period seen with VDDR>threshold.
#define MAX_USED_PER_SFT    0
#define MAX_USED_PER_MSK    0xffff

/* Oscillator Configuration */
#define OSCCFG                  MMIO32(AON_WUC + 0x38)
// Number of 32 KHz clocks between oscillator amplitude calibrations.
#define PER_M_SFT  3
#define PER_M_MSK  0x1f
#define PER_E_SFT  0
#define PER_E_MSK  0x7

/* JTAG Configuration */
#define JTAGCFG                 MMIO32(AON_WUC + 0x40)
// Controls JTAG PowerDomain power state.
#define JTAG_PD_FORCE_ON    0x00000100

/* JTAG USERCODE */
#define JTAGUSERCODE            MMIO32(AON_WUC + 0x44)
//USER_CODE


/* Infrastructure Clock Division Factor For Run Mode */
#define INFRCLKDIVR             MMIO32(PRCM + 0x000)
/* Infrastructure Clock Division Factor For Sleep Mode */
#define INFRCLKDIVS             MMIO32(PRCM + 0x004)
/* Infrastructure Clock Division Factor For DeepSleep Mode */
#define INFRCLKDIVDS            MMIO32(PRCM + 0x008)
// Division rate for clocks driving modules in the MCU_AON domain.
#define RATIO_DIV1   0x00000000
#define RATIO_DIV2   0x00000001
#define RATIO_DIV8   0x00000002
#define RATIO_DIV32  0x00000003

/* MCU Voltage Domain Control */
#define VDCTL                   MMIO32(PRCM + 0x00c)
// Request WUC to power down the MCU voltage domain
#define MCU_VD  0x00000004
// Request WUC to switch to uLDO.
#define ULDO    0x00000001

/* Load PRCM Settings To CLKCTRL Power Domain */
#define CLKLOADCTL              MMIO32(PRCM + 0x028)
// Status of LOAD.
#define LOAD_DONE   0x00000002
// 1: Load settings to CLKCTRL.
#define LOAD        0x00000001

/* RFC Clock Gate */
#define RFCCLKG                 MMIO32(PRCM + 0x02c)
// 1: Enable clock if RFC power domain is on
#define CLK_EN    0x00000001

/* VIMS Clock Gate */
#define VIMSCLKG                MMIO32(PRCM + 0x030)
//CLK_EN

/* TRNG, CRYPTO And UDMA Clock Gate For Run Mode */
#define SECDMACLKGR             MMIO32(PRCM + 0x03c)
/* TRNG, CRYPTO And UDMA Clock Gate For Sleep Mode */
#define SECDMACLKGS             MMIO32(PRCM + 0x040)
/* TRNG, CRYPTO And UDMA Clock Gate For Deep Sleep Mode */
#define SECDMACLKGDS            MMIO32(PRCM + 0x044)
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define DMA_CLK_EN      0x00000100
//...
#define TRNG_CLK_EN     0x00000002
//...
#define CRYPTO_CLK_EN   0x00000001

/* GPIO Clock Gate For Run Mode */
#define GPIOCLKGR               MMIO32(PRCM + 0x048)
/* GPIO Clock Gate For Sleep Mode */
#define GPIOCLKGS               MMIO32(PRCM + 0x04c)
/* GPIO Clock Gate For Deep Sleep Mode */
#define GPIOCLKGDS              MMIO32(PRCM + 0x050)
// CLK_EN

/* GPT Clock Gate For Run Mode */
#define GPTCLKGR                MMIO32(PRCM + 0x054)
/* GPT Clock Gate For Sleep Mode */
#define GPTCLKGS                MMIO32(PRCM + 0x058)
/* GPT Clock Gate For Deep Sleep Mode */
#define GPTCLKGDS               MMIO32(PRCM + 0x05c)
//...
#define CLK_EN_GPT0 0x00000001
#define CLK_EN_GPT1 0x00000002
#define CLK_EN_GPT2 0x00000004
#define CLK_EN_GPT3 0x00000008

/* I2C Clock Gate For Run Mode */
#define I2CCLKGR                MMIO32(PRCM + 0x060)
/* I2C Clock Gate For Sleep Mode */
#define I2CCLKGS                MMIO32(PRCM + 0x064)
/* I2C Clock Gate For Deep Sleep Mode */
#define I2CCLKGDS               MMIO32(PRCM + 0x068)
// CLK_EN

/* UART Clock Gate For Run Mode */
#define UARTCLKGR               MMIO32(PRCM + 0x06c)
/* UART Clock Gate For Sleep Mode */
#define UARTCLKGS               MMIO32(PRCM + 0x070)
/* UART Clock Gate For Deep Sleep Mode*/
#define UARTCLKGDS              MMIO32(PRCM + 0x074)
// CLK_EN

/* SSI Clock Gate For Run Mode */
#define SSICLKGR                MMIO32(PRCM + 0x078)
/* SSI Clock Gate For Sleep Mode */
#define SSICLKGS                MMIO32(PRCM + 0x07c)
/* SSI Clock Gate For Deep Sleep Mode */
#define SSICLKGDS               MMIO32(PRCM + 0x080)
//...
#define CLK_EN_SSI0 0x00000001
#define CLK_EN_SSI1 0x00000002

/* I2S Clock Gate For Run Mode */
#define I2SCLKGR                MMIO32(PRCM + 0x084)
/* I2S Clock Gate For Sleep Mode */
#define I2SCLKGS                MMIO32(PRCM + 0x088)
/* I2S Clock Gate For Deep Sleep Mode */
#define I2SCLKGDS               MMIO32(PRCM + 0x08c)
// CLK_EN

/* CPUCLKDIV Register */
#define CPUCLKDIV               MMIO32(PRCM + 0x0b8)
//...
#define CPUCLKDIV_RATIO 0x00000001

/* I2S Clock Control */
#define I2SBCLKSEL              MMIO32(PRCM + 0x0c8)
//...
#define SPARE_SFT   1
#define SPARE_MSK   0x7fffffff
// BCLK source selector
#define I2S_SRC 0x00000001

/* GPT Scalar */
#define GPTCLKDIV               MMIO32(PRCM + 0x0cc)
// Scalar used for GPTs.
#define GPT_RATIO_DIV1   0x00000000
#define GPT_RATIO_DIV2   0x00000001
#define GPT_RATIO_DIV4   0x00000002
#define GPT_RATIO_DIV8   0x00000003
#define GPT_RATIO_DIV16  0x00000004
#define GPT_RATIO_DIV32  0x00000005
#define GPT_RATIO_DIV64  0x00000006
#define GPT_RATIO_DIV128 0x00000007
#define GPT_RATIO_DIV256 0x00000008

/* I2S Clock Control */
#define I2SCLKCTL               MMIO32(PRCM + 0x0d0)
// On the I2S serial interface, data and WCLK is sampled and clocked.
#define SMPL_ON_POSEDGE     0x00000008
// Decides how the WCLK division ratio is calculated.
#define WCLK_PHASE_SINGLE   0x00000000
#define WCLK_PHASE_DUAL     0x00000002
#define WCLK_PHASE_USER     0x00000004
// 1: Enables the generation of MCLK, BCLK and WCLK
#define I2S_EN              0x00000001

/* MCLK Division Ratio */
#define I2SMCLKDIV              MMIO32(PRCM + 0x0d4)
// An unsigned factor of the division ratio used to generate MCLK [2-1024].
#define MDIV_MSK    0x3ff

/* BCLK Division Ratio */
#define I2SBCLKDIV              MMIO32(PRCM + 0x0d8)
// An unsigned factor of the division ratio used to generate I2S BCLK [2-1024].
#define BDIV_MSK    0x3ff

/* WCLK Division Ratio */
#define I2SWCLKDIV              MMIO32(PRCM + 0x0dc)
// ratio
#define WDIV_MSK    0x3ff

/* SW Initiated Resets */
#define SWRESET                 MMIO32(PRCM + 0x10c)
//...
#define MCU 0x00000004

/* WARM Reset Control And Status */
#define WARMRESET               MMIO32(PRCM + 0x110)
// 1: A warm system reset event triggered by the below listed sources.
#define WR_TO_PINRESET  0x00000004
// 1: A system CPU LOCKUP event has occured since last SW clear of the register.
#define LOCKUP_STAT     0x00000002
// 1: A WDT event has occured since last SW clear of the register.
#define WDT_STAT        0x00000001

/* Power Domain Control */
#define PDCTL0                  MMIO32(PRCM + 0x12c)
// PERIPH Power domain.
#define PERIPH_ON   0x00000004
// SERIAL Power domain.
#define SERIAL_ON   0x00000002
// 1: RFC power domain powered on
#define RFC_ON      0x00000001

/* RFC Power Domain Control */
#define PDCTL0RFC               MMIO32(PRCM + 0x130)
// Alias for PDCTL0.RFC_ON
#define ON  0x00000001

/* SERIAL Power Domain Control */
#define PDCTL0SERIAL            MMIO32(PRCM + 0x134)
//ON

/* PERIPH Power Domain Control */
#define PDCTL0PERIPH            MMIO32(PRCM + 0x138)
//ON

