dltech/headphones/lib/cc2640_reg/prcm_reg.h
/* Power Domain Status */
#define PDSTAT0                 MMIO32(PRCM + 0x140)
// PERIPH_ON
// SERIAL_ON
// RFC_ON

/* RFC Power Domain Status */
#define PDSTAT0RFC              MMIO32(PRCM + 0x144)
//ON

/* SERIAL Power Domain Status */
#define PDSTAT0SERIAL           MMIO32(PRCM + 0x148)
//ON

/* PERIPH Power Domain Status */
#define PDSTAT0PERIPH           MMIO32(PRCM + 0x14c)
//ON

/* Power Domain Control */
#define PDCTL1                  MMIO32(PRCM + 0x17c)
// 1: VIMS power domain is powered whenever the BUS power domain is powered.
#define VIMS_MODE   0x00000008
// 1: RFC power domain powered on
#define RFC_ON      0x00000004
// 1: Initiates power-on of the CPU power domain.
#define CPU_ON      0x00000002

/* CPU Power Domain Direct Control */
#define PDCTL1CPU               MMIO32(PRCM + 0x184)
//ON

/* RFC Power Domain Direct Control */
#define PDCTL1RFC               MMIO32(PRCM + 0x188)
//ON

/* VIMS Mode Direct Control */
#define PDCTL1VIMS              MMIO32(PRCM + 0x18c)
//ON

/* Power Manager Status */
#define PDSTAT1                 MMIO32(PRCM + 0x194)
// 1: BUS domain is currently accessible
#define BUS_ON      0x00000010
// 1: VIMS domain is currently accessible
#define VIMS_MODE   0x00000008
// 1: RFC domain is currently accessible
#define RFC_ON      0x00000004
// 1: CPU and BUS domains are both currently accessible
#define CPU_ON      0x00000002

/* BUS Power Domain Direct Read Status */
#define PDSTAT1BUS              MMIO32(PRCM + 0x198)
//ON

/* RFC Power Domain Direct Read Status */
#define PDSTAT1RFC              MMIO32(PRCM + 0x19c)
//ON

/* CPU Power Domain Direct Read Status */
#define PDSTAT1CPU              MMIO32(PRCM + 0x1a0)
//ON

/* VIMS Mode Direct Read Status */
#define PDSTAT1VIMS             MMIO32(PRCM + 0x1a4)
//ON

/* Control To RFC */
#define RFCBITS                 MMIO32(PRCM + 0x1cc)
//READ

/* Selected RFC Mode */
#define RFCMODESEL              MMIO32(PRCM + 0x1d0)
// Selects the set of commands that the RFC will accept.
#define CURR_MODE0  0x00000000
#define CURR_MODE1  0x00000001
#define CURR_MODE2  0x00000002
#define CURR_MODE3  0x00000003
#define CURR_MODE4  0x00000004
#define CURR_MODE5  0x00000005
#define CURR_MODE6  0x00000006
#define CURR_MODE7  0x00000007

/* Allowed RFC Modes */
#define RFCMODEHWOPT            MMIO32(PRCM + 0x1d4)
// Permitted RFC modes. More than one mode can be permitted.
#define AVAIL_MODE0  0x00000000
#define AVAIL_MODE1  0x00000001
#define AVAIL_MODE2  0x00000002
#define AVAIL_MODE3  0x00000003
#define AVAIL_MODE4  0x00000004
#define AVAIL_MODE5  0x00000005
#define AVAIL_MODE6  0x00000006
#define AVAIL_MODE7  0x00000007

/* Power Profiler Register */
#define PWRPROFSTAT             MMIO32(PRCM + 0x1e0)
// SW can use these bits to timestamp the application.
#define VALUE_MSK   0xff

/* Memory Retention Control */
#define RAMRETEN                MMIO32(PRCM + 0x224)
// 1: Retention for RFC SRAM enabled
#define RFC         0x00000004
// 1: Memory retention enabled
#define VIMS_TRAM   0x00000001
#define VIMS_CRAM   0x00000002

#endif
